artillery/flood.yml
config:
  target: 'https://dxcg7rsph2.execute-api.eu-west-1.amazonaws.com'
  phases:
    - duration: 5
      arrivalRate: 50
  payload:
    path: "learnings.csv"
    fields:
      - "creator"
      - "learning"
      - "session"
      - "category"
scenarios:
  - flow:
      - post:
          url: "/learnings"
          json:
            creator: "{{ creator }}"
            learning: "{{ learning }}"
            session: "{{ session }}"
            category: "{{ category }}"